app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @restaurant = Restaurant.find_by_id(params[:id])

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "26 Seats"], ["created_at", "2016-05-22 03:31:13.290412"], ["updated_at", "2016-05-22 03:31:13.290412"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @restaurant = Restaurant.find_by_id(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "restaurants" SET "street" = ?, "city" = ?, "state" = ?, "country" = ?, "postal_code" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["street", "150 7th St"], ["city", "New York"], ["state", "NY"], ["country", "US"], ["postal_code", "10009"], ["updated_at", "2016-05-22 04:41:18.080024"], ["id", 28]]
---
  def update
    @restaurant = Restaurant.find_by_id(params[:id])

    if @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 25]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 25]]
---
  def destroy
    @restaurant = Restaurant.find_by_id(params[:id])
    @restaurant.delete